mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54S018_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fmeas" Cversion="2.1.0" condition="device.LPC54S018_AND_driver.common">
      <description>FMEAS Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_fmeas.c"/>
        <file category="header" name="drivers/fsl_fmeas.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fro_calib" Cversion="2.0.0" condition="device.LPC54S018_AND_driver.common">
      <description>FRO calibration Lib</description>
      <files>
        <file condition="mdk" category="library" name="arm/keil_lib_fro_calib.lib"/>
        <file category="header" name="drivers/fsl_fro_calib.h"/>
        <file condition="iar" category="library" name="iar/iar_lib_fro_calib.a"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="device.LPC54S018_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/ft5406/fsl_ft5406.c"/>
        <file category="header" name="components/ft5406/fsl_ft5406.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.common">
      <description>GINT Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_gint.c"/>
        <file category="header" name="drivers/fsl_gint.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iap" Cversion="2.0.2" condition="device.LPC54S018_AND_driver.common">
      <description>IAP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_iap.c"/>
        <file category="header" name="drivers/fsl_iap.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.0" condition="device.LPC54S018_AND_driver.common_AND_driver.inputmux_connections">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_inputmux.c"/>
        <file category="header" name="drivers/fsl_inputmux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.common">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="drivers/fsl_inputmux_connections.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.3.1" condition="device.LPC54S018_AND_driver.common">
      <description>ADC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.common">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_crc.c"/>
        <file category="header" name="drivers/fsl_crc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.3.0" condition="device.LPC54S018_AND_driver.common">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dma.c"/>
        <file category="header" name="drivers/fsl_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_enet" Cversion="2.1.3" condition="device.LPC54S018_AND_driver.common">
      <description>enet Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_enet.c"/>
        <file category="header" name="drivers/fsl_enet.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.4" condition="device.LPC54S018_AND_driver.common">
      <description>GPIO Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_gpio.c"/>
        <file category="header" name="drivers/fsl_gpio.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.1.1" condition="device.LPC54S018_AND_driver.common">
      <description>IOCON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_iocon.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lcdc" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.common">
      <description>LCDC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lcdc.c"/>
        <file category="header" name="drivers/fsl_lcdc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc" Cversion="2.0.0" condition="device.LPC54S018_AND_driver.common">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_rtc.c"/>
        <file category="header" name="drivers/fsl_rtc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mcan" Cversion="2.1.0" condition="device.LPC54S018_AND_driver.common">
      <description>MCAN Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_mcan.c"/>
        <file category="header" name="drivers/fsl_mcan.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="device.LPC54S018_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/mma8652fc/fsl_mma.c"/>
        <file category="header" name="components/mma8652fc/fsl_mma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.common">
      <description>MRT Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_mrt.c"/>
        <file category="header" name="drivers/fsl_mrt.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="otp" Cversion="2.0.0" condition="device.LPC54S018_AND_driver.common">
      <description>OTP Driver</description>
      <files>
        <file category="header" name="drivers/fsl_otp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phylan8720a" Cversion="1.0.0" condition="device.LPC54S018_AND_driver.lpc_enet">
      <description/>
      <files>
        <file category="sourceC" name="components/phylan8720a/fsl_phy.c"/>
        <file category="header" name="components/phylan8720a/fsl_phy.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.1.3" condition="device.LPC54S018_AND_driver.common">
      <description>PINT Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pint.c"/>
        <file category="header" name="drivers/fsl_pint.h"/>
      </files>
    </component>
